; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v7 - type_1 ?v6 - type_3)
 	      (pred_2 ?v4 - object ?v6 - type_3)
	      (pred_3 ?v7 - type_1 ?v3 - type_2)
	      (pred_1 ?v7 - type_1 ?v4 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v8 ?v2 - type_3)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v2)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_1 ?v5 - object ?v1 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v1) (pred_4 ?v7 ?v1) (pred_3 ?v7 ?v3))
       :effect (and (pred_1 ?v7 ?v5 ?v3)
		    (not (pred_2 ?v5 ?v1)) 
		    (not (pred_3 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_1 ?v5 - object ?v1 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v5 ?v3) (pred_4 ?v7 ?v1))
       :effect (and (pred_2 ?v5 ?v1)
		    (pred_3 ?v7 ?v3)
		    (not (pred_1 ?v7 ?v5 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_08 obj_04 - type_2
obj_01 obj_03 obj_09 - type_3
obj_02 obj_06 obj_05 - object)
(:init
(pred_4 obj_07 obj_03)
(pred_3 obj_07 obj_08)
(pred_3 obj_07 obj_04)
(pred_2 obj_02 obj_03)
(pred_2 obj_06 obj_03)
(pred_2 obj_05 obj_01)
)
(:goal
(and
(pred_2 obj_02 obj_09)
(pred_2 obj_06 obj_09)
(pred_2 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_07 ?b obj_08))))
)
)

; plan
1. (op_2 obj_07 obj_06 obj_03 obj_04)
   deleted: (pred_2 obj_06 obj_03) (pred_3 obj_07 obj_04)
   added: (pred_1 obj_07 obj_06 obj_04)
   goals met: 1 of 3
2. (op_1 obj_07 obj_03 obj_09)
   deleted: (pred_4 obj_07 obj_03)
   added: (pred_4 obj_07 obj_09)
   goals met: 1 of 3
3. (op_3 obj_07 obj_06 obj_09 obj_04)
   deleted: (pred_1 obj_07 obj_06 obj_04)
   added: (pred_2 obj_06 obj_09) (pred_3 obj_07 obj_04)
   goals met: 2 of 3
4. (op_1 obj_07 obj_09 obj_03)
   deleted: (pred_4 obj_07 obj_09)
   added: (pred_4 obj_07 obj_03)
   goals met: 2 of 3
5. (op_2 obj_07 obj_02 obj_03 obj_04)
   deleted: (pred_2 obj_02 obj_03) (pred_3 obj_07 obj_04)
   added: (pred_1 obj_07 obj_02 obj_04)
   goals met: 2 of 3
6. (op_1 obj_07 obj_03 obj_09)
   deleted: (pred_4 obj_07 obj_03)
   added: (pred_4 obj_07 obj_09)
   goals met: 2 of 3
7. (op_3 obj_07 obj_02 obj_09 obj_04)
   deleted: (pred_1 obj_07 obj_02 obj_04)
   added: (pred_2 obj_02 obj_09) (pred_3 obj_07 obj_04)
   goals met: 3 of 3
